// 自定义模块
const username = 'admin';

function whoAmI() {
    console.log(`I am ${username}`);
}
module.exports = {username, whoAmI};
/*
你说的是
高手下山
    ->带着婚约
        ->被女主瞧不起
            ->英雄救美，震惊女主
                ->背靠女主，无限后宫
	->受邀而来
		->当女主保镖
			->入学/入职 被二代瞧不起
				->初始女二号，无限支持男主
					->英雄救美，女主态度改观
						->悄悄咪咪，后宫开遍
							->和女主坦白，光明正大开后宫
还是仙帝重生
    ->湖边/公园/山顶遇见老头带着孙女/侄女/女儿
        ->半步宗师/宗师 摘花飞叶皆可伤人 震惊老头
            ->老头讨好，送x女
                ->x女贴生，震惊熟/路人
                    ->后宫
还是都市休仙
    ->捡到/祖传功法
        ->受到大势力看重，结识女主
            ->被小人物看不起
                ->打脸小人物，震惊女主
                    ->势力危机，力挽狂澜
                        ->女主归心
                            ->后宫
还是龙王/战神归来
    ->妻/女被虐待/杀害
        ->怒，杀
            ->仇家震惊
                ->阖家团圆，变日常文
                ->后宫
还是赘婿
    ->三年期满
        ->震惊女主家
            ->不知
        ->女主质问
            ->暗中相助
                ->女主疑惑 最近咋这么顺利
                    ->不和女主坦白，去开后宫
                        ->渐入佳境，女主改观
                            ->木已成舟，坦白女主，众女归心
还是神豪/娱乐系统
    神豪->屌丝有钱，暴发户心态
        ->后宫，不想着父母，穿着地摊货天天打脸，无趣
    娱乐->网吧菜鸡，被嘲讽
        ->临时替补，震惊众人
            ->一路比赛，相识女主，并获得女主好感
                ->后宫
还是重回xx
    ->利用信息差赚钱
        ->后宫
*/